#!/usr/bin/python
# -*- coding: utf-8 -*-
#因为peak hell连起来读音类似pickle(这里想了很久。。不知道还有这种操作)
#从网页源码的banner.p取出数据，用pickle反序列化得到list

import urllib2
import pickle
req = urllib2.Request('http://www.pythonchallenge.com/pc/def/banner.p')
response = urllib2.urlopen(req)
result = response.read()
res_list =  pickle.loads(result)
#打印list
#这里打印list图像也想了很久。。没经验啊
#这里用到了生成式简化代码

for list_b in res_list:
     print("".join(k*v for k, v in list_b))

#output:
              #####                                                                      #####
               ####                                                                       ####
               ####                                                                       ####
               ####                                                                       ####
               ####                                                                       ####
               ####                                                                       ####
               ####                                                                       ####
               ####                                                                       ####
      ###      ####   ###         ###       #####   ###    #####   ###          ###       ####
   ###   ##    #### #######     ##  ###      #### #######   #### #######     ###  ###     ####
  ###     ###  #####    ####   ###   ####    #####    ####  #####    ####   ###     ###   ####
 ###           ####     ####   ###    ###    ####     ####  ####     ####  ###      ####  ####
 ###           ####     ####          ###    ####     ####  ####     ####  ###       ###  ####
####           ####     ####     ##   ###    ####     ####  ####     #### ####       ###  ####
####           ####     ####   ##########    ####     ####  ####     #### ##############  ####
####           ####     ####  ###    ####    ####     ####  ####     #### ####            ####
####           ####     #### ####     ###    ####     ####  ####     #### ####            ####
 ###           ####     #### ####     ###    ####     ####  ####     ####  ###            ####
  ###      ##  ####     ####  ###    ####    ####     ####  ####     ####   ###      ##   ####
   ###    ##   ####     ####   ###########   ####     ####  ####     ####    ###    ##    ####
      ###     ######    #####    ##    #### ######    ###########    #####      ###      ######
#下一级为url:http://www.pythonchallenge.com/pc/def/channel.html
